In [34]:
import pandas as pd
import numpy as np

In [215]:
data1 = pd.read_csv(
    "../test.csv",
    usecols=["Participant ID", "Measure Code", "Result"]
)
data1.replace(to_replace = "43619-", value = "43619EP-", regex = True, inplace = True)
data1.rename(columns = {"Participant ID" : "study_id", "Measure Code" : "measure_code", "Result" : "result"}, inplace = True)

In [216]:
data1

      study_id measure_code  result
0  43619EP-001        SWMTE       2
1  43619EP-001        PALTE       3
2  43619EP-002        SWMTE       4
3  43619EP-002        PALTE       5
4  43619EP-004        SWMTE       6
5  43619EP-004        PALTE       7
6  43619EP-005        SWMTE       8
7  43619EP-005        PALTE       9
8  43619EP-006        SWMTE      10
9  43619EP-006        PALTE      11

In [218]:
data1pivoted = data1.pivot(index = 'study_id', columns = 'measure_code')
data1pivoted

             result
measure_code  PALTE SWMTE
study_id
43619EP-001       3     2
43619EP-002       5     4
43619EP-004       7     6
43619EP-005       9     8
43619EP-006      11    10

In [219]:
data1pivoted.to_csv("data1.csv", sep = ",")

In [220]:
CANTAB =  pd.read_csv("data1.csv")
data2 = pd.read_csv(
    "../test2.csv")

CANTAB.rename(columns = {"Unnamed: 0" : "study_id", "result" : "PALTE_score", "result.1" : "SWMTE_score"}, inplace = True)

CANTAB_final = CANTAB.drop([0,1])
CANTAB_final

      study_id PALTE_score SWMTE_score
2  43619EP-001           3           2
3  43619EP-002           5           4
4  43619EP-004           7           6
5  43619EP-005           9           8
6  43619EP-006          11          10

In [222]:
final = pd.merge(CANTAB_final, data2, on = "study_id")
final

      study_id PALTE_score SWMTE_score  age  sex  memory
0  43619EP-001           3           2  123    0     0.1
1  43619EP-002           5           4  124    1     1.1
2  43619EP-004           7           6  126    1     3.1
3  43619EP-005           9           8  127    1     4.1
4  43619EP-006          11          10  128    0     5.1

In [ ]:
final.to_csv("PRANKDataMerged.csv", sep = ",")